//예제모음 01
# include <stdio.h>

int main()
{
	int a, b, c, d;
	int result;

	printf("첫 번째 계산할 값을 입력하세요 ==> ");
	scanf_s("%d", &a);
	printf("두 번째 계산할 값을 입력하세요 ==> ");
	scanf_s("%d", &b);
	printf("세 번째 계산할 값을 입력하세요 ==> ");
	scanf_s("%d", &c);
	printf("네 번째 계산할 값을 입력하세요 ==> ");
	scanf_s("%d", &d);

	result = a + b + c + d;
	printf("%d + %d + %d + %d = %d\n", a, b, c, d, result);

}

//예제모음 02
//예제모음 03
//예제모음 04
//예제모음 05
//예제모음 06
//예제모음 07
//예제모음 08
//예제모음 09
//예제모음 10
//예제모음 11
//예제모음 12
//예제모음 13
//예제모음 14
//예제모음 15
//예제모음 16
//예제모음 17
//예제모음 18
//예제모음 19
//예제모음 20
//예제모음 21
//예제모음 22
//예제모음 23
//예제모음 24
//예제모음 25
//예제모음 26
//예제모음 27
//예제모음 28
//예제모음 29
//예제모음 30
//예제모음 31
//예제모음 32
//예제모음 33
//예제모음 34
//예제모음 35
//예제모음 36
//예제모음 37
//예제모음 38
//예제모음 39
//예제모음 40
